{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "valid", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "name": "conv1d_1", "activation": "relu", "batch_input_shape": [null, 2351, 1], "kernel_size": [64], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "strides": [64]}, "class_name": "Conv1D"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "name": "conv1d_2", "kernel_size": [3], "bias_regularizer": null, "filters": 128, "padding": "valid", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "strides": [2]}, "class_name": "Conv1D"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "name": "dense_1", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "name": "dense_2", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "name": "dense_3", "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}